//Задание 1. Создайте решение (проект) с помощью, которого можно узнавать кулинарные рецепты. Типичный пример работы    
//▪ клиентское приложение подключается к серверу;    
//▪ клиентское приложение посылает запрос с указанием списка продуктов;
//▪ сервер возвращает рецепты, содержащие указанные продукты;  
//▪ клиент может послать новый запрос или отключиться.

//Задание 2. Добавьте оконный интерфейс для управления сервером. Также добавьте оконный интерфейс для управления клиентом.

//Дополнительно:
//Задание 3. Добавьте механизм логирования в сервер.
//Этот механизм должны сохранять информацию о клиентах, их запросах, времени соединения и т.д.
//Задание 4. Редактирование рецептов, включая изображения.